<?php

namespace Database\Seeders\EventDummyData;

class MovieData
{
public static $category_id = 5;
public static $data = [
  [
    'title' => '別叫我賭神',
    'description' => '吹水輝為賭場常客，在賭桌上輸得身無分文。他和好友花叔（廖啟智 飾）、肥狗（方中信 飾）有一間小理髮店，但卻無法支持他的賭博嗜好。吹水輝的前女友李夕（袁詠儀 飾）突然出現，要求他照顧「他們」的兒子李陽（柯煒林 飾）一個月，並奉上酬金。見錢開眼的吹水輝敷衍了事接下了褓姆任務，才發現兒子是自閉症患者。獨居的吹水輝完全無法應付這兒子的特殊需求，父子關係日趨緊繃…隨著李陽逐漸展現出天賦，吹水輝也彷彿找到了人生目標，下定決心脫離過去的荒唐人生，陪伴兒子展翅圓夢。',
    'start_at' => '2023-6-07 00:00:00',
    'end_at' => '2023-7-07 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/43d67_OneMoreChance_Poster_1686058038.jpg',
  ],
  [
    'title' => '露比格曼：海怪神話',
    'description' => '夢工場動畫多年來締造了不少經典系列：《史力加》《馴龍記》《無敵貓劍俠》等，雀躍萬千動畫影迷。上述班底再下一城，今年暑假推出全新角色和故事——《露比格曼：海怪神話》(Ruby Gillman, Teenage Kraken) ——水上世界英雄聯盟，跳出汪洋大海變身出擊；糅合搞笑溫情、活現動盪的波濤翻湧，成為環球影業發行的最精彩合家歡大冒險。

    可愛卻害羞的十六歲少女露比格曼，一直被虎媽嚴禁跟任何在海灘玩的孩子接觸，更絕不能下水。直到她意外地破戒後，驚現自己擁有神一般海怪血統，乃「海怪戰后」後裔，更命中注定要繼承她「七海戰后」祖母的女王寶座！
    
    海怪族誓要保護海洋，免受貪慕虛榮、權力掛帥的美人魚族侵害，然而美人魚與海怪之間的恩怨戰史已超過億萬年。露比發現自己的真正命途藏於深邃海洋裡，超乎想像；她必須接受命運，勇敢地保護她的所愛⋯⋯',
    'start_at' => '2023-6-07 00:00:00',
    'end_at' => '2023-7-07 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/43219__finalposter_rgtk_LATAMposter_1_1686305107.jpg',
  ],
  [
    'title' => '閃電俠',
    'description' => '華納兄弟本年度最石破天驚、雷霆萬鈞的超級鉅製——《閃電俠》(THE FLASH)，執導於橫掃口碑的《小丑回魂》導演安迪慕式提，影星艾薩米勒 (Ezra Miller) 將回歸「閃電俠」一角，出演首部以此超級英雄為主角的真人版獨立電影。

    巴利艾倫運用他的超能力穿越時空，回到過去阻止兇徒謀殺母親，卻在無意間改變未來，令自己困在薩德將軍回歸肆虐、勢要毀滅地球的黑暗時空，並沒有超級英雄可以伸出援手！他唯一可以做的，就是說服一個與別不同的蝙蝠俠重出江湖，並從獄中拯救一位跟他想像中全不一樣的超人出來幫拖⋯⋯「閃電俠」為了拯救他身處的世界，並回到他熟知的未來，必須以神速與敵人競賽；但他作出的犧牲，是否足以將他扭曲了的宇宙撥亂反正？
    
    《閃電俠》強勁卡士包括《女超人》索女新星莎莎哥利 (Sasha Calle)、《蝙蝠俠對超人：正義曙光》米高沙朗 (Michael Shannon)、《詭屋驚凶實錄》朗李雲斯頓 (Ron Livingston) 、《名校風暴》瑪莉貝爾維杜 (Maribel Verdú)、《正義聯盟》琦斯克雷文 (Kiersey Clemons)、《超人：鋼鐵英雄》安潔陶依 (Antje Traue) 及《蝙蝠俠》米高基頓 (Michael Keaton)。',
    'start_at' => '2023-6-07 00:00:00',
    'end_at' => '2023-7-07 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/30639_theflashmainposter_1__1682576457.jpg',
  ],
  [
    'title' => '奪寶奇兵：命運輪盤',
    'description' => '經典賣座奪寶歷險系列，全新鉅製《奪寶奇兵之命運輪盤》由奧斯卡提名巨星夏里遜福強勢回歸，飾演傳奇英雄考古學家鍾斯博士 (Indiana Jones)，再次展開驚險刺激的終極奪寶之旅！由《盧根》(Logan) 導演占士曼高(James Mangold)執導，《奪寶奇兵之命運輪盤》將於6月29日大銀幕獻映。',
    'start_at' => '2023-6-29 00:00:00',
    'end_at' => '2023-7-29 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/41db4_Indiana_Jones_5_Main_Poster_27_4_32_1687842148.jpg',
  ],
  [
    'title' => '調教你處男',
    'description' => '想出pool？Mad姐幫到你！Sony Pictures呈獻，《曳曳同學會》導演最新編導，聯同《PARTY冇限耆》編劇合力炮製搞嘢爆笑新作《調教你處男》（No Hard Feelings），對白啜核踩界尺度無限！今次更由金像影后珍妮花羅倫絲貼身調教，出pool不再是夢！

    輕熟女Mad姐手緊要揾快錢，唔係連間屋都冇埋！又咁啱俾佢見到一對勁有錢直升機家長出嘅招聘廣告：「想要車？帶我個仔出pool啦！」Mad姐見到梗係馬上𦧲飯應…… 點知呢位19歲青頭Percy仔一經調教馬上爆！究竟Mad姐點部署先可以完成任務，喺Percy仔入U前成功出pool？',
    'start_at' => '2023-6-29 00:00:00',
    'end_at' => '2023-7-29 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/3d3a4_NoHardFeelings_HKPoster_621paidsneak_1686047164.jpg',
  ],
  [
    'title' => '蜘蛛俠：飛躍蜘蛛宇宙',
    'description' => 'Sony Pictures榮譽發行、奧斯卡最佳動畫電影《蜘蛛俠：跳入蜘蛛宇宙》最新一章《蜘蛛俠：飛躍蜘蛛宇宙》即將登場！穿梭於紐約布魯克林大街小巷守護居民的「蜘蛛仔」麥爾斯，跟桂恩史德西重逢後，被神秘力量帶領進入一個充滿各式各樣「蜘蛛俠」的多元宇宙。當「蜘蛛俠」們遇到危險打算聯手抗敵時，麥爾斯卻發現自己與他們產生矛盾，更被迫要與其他「蜘蛛俠」對抗，他必需重新審視成為英雄的意義，才能守護他所愛的人！',
    'start_at' => '2023-6-29 00:00:00',
    'end_at' => '2023-7-29 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/54358_SV2_FinalPoster_1684990677.jpg',
  ],
  [
    'title' => '變形金剛：狂獸崛起',
    'description' => '荷里活賣座電影系列《變形金剛》回歸經典本色，推出最新一集作品：《變形金剛：狂獸崛起》，以最吸睛的特技動作及磅礡場面，帶領觀眾回到以九十年代作為背景的激戰舞台。今次將會有全新派系「密斯武」現身，與博派在地球並肩作戰。《王者之後：重拳復仇》導演史提芬卡普執導；《哥斯拉II：王者巨獸》安東尼雷莫斯及《猶大與黑色彌賽亞》多美妮費舒伯克主演；《變形金剛：狂獸崛起》，2023年6月8日進擊全球大銀幕。3D版同步震撼登場',
    'start_at' => '2023-6-29 00:00:00',
    'end_at' => '2023-7-29 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/4edea_TF7_INTL_DGTL_Payoff_Digital_Key_Art_Unite_1080x1350_INSTA_HKG_1__1682659871.jpg',
  ],
  [
    'title' => '怪物',
    'description' => '《小偷家族》康城金棕櫚獎大導演是枝裕和、金牌編劇坂元裕二、殿堂級音樂大師坂本龍一，破天荒終極聯手合作！平靜的湖畔小鎮，疼愛兒子的單親媽媽早織（安藤櫻 飾）、為學生著想的爽直老師保利 （永山瑛太 飾）以及天真爛漫的孩子們本過著安穩的生活，卻因為一次校園衝突，發酵釀成軒然大波，惹起社會與媒體的關注。當事態越見嚴重，竟在一個暴風雨的清晨，兩個孩子雙雙失去了蹤影…… 榮獲第76屆康城影展最佳劇本，今個6月，誰是怪物？',
    'start_at' => '2023-6-29 00:00:00',
    'end_at' => '2023-7-29 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/327fb__CannesAward_Monster27x38mainposterrevise-02_1__1686203152.jpg',
  ],
  [
    'title' => '新．幪面超人',
    'description' => '「改變的，不改變的，還有不想改變的事物。」

    頭腦敏銳及運動細胞極佳的本鄉猛（池松壯亮 飾），經由神秘組織．SHOCKER 改造成強化人，獲得超乎常人的力量。表面上是以「實現全人類都得到幸福」為目標而創立的SHOCKER，實際卻是另有所圖。為了守護人類、為了以「人類的姿態」活下去，本鄉猛以幪面超人的身份，與綠川瑠璃子（濱邊美波 飾）挺身而戰——',
    'start_at' => '2023-6-29 00:00:00',
    'end_at' => '2023-7-29 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/29bf0_SMR_Keyart_0517_1684502393.jpg',
  ],
  [
    'title' => '速命道',
    'description' => '一輛救護車與神秘的跑車「地獄貓」從港口、山道一路廝殺到高速公路，城市之中彷彿武當之巔高手過招，到底新一代的車神會是誰？如果兩個只能活一個，誰人笑到最後？

    開著救護車的是「小樂」（瘦子飾）一個曾經的最佳賽車手。小樂在一場與哥哥「阿杰」（柯有倫飾）的比試中，讓哥哥意外身亡，小樂自暴自棄，直到遇見女醫生「慧慧」（Ella陳嘉樺飾），轉念成為了救護車司機，誓言要「用速度救人」。然而一名神秘賽車手「地獄貓」的主人突然現身，他手握名冊，被挑戰的賽車手最終必然喪命……地下賽車，就是一場現代武林，儘管以生命作為代價，仍無法阻擋狂熱者對速度進行宿命般的追逐。在小樂的死黨「三寶」（大淵、林真亦、林志謙飾）的調查下，各個意外的真相將逐漸浮現……',
    'start_at' => '2023-6-29 00:00:00',
    'end_at' => '2023-7-29 23:59:59',
    'venue' => 'Movie venue',
    'lat' => 22.2833586,
    'lng' => 114.1607157,
    'image_url' => 'https://storage.movie6.com/movie/34026_poster_1686222840.jpg',
  ],
//   [
//     'title' => 'value'
//     'description' => 'value'
//     'start_at' => 'value'
//     'end_at' => 'value'
//     'venue' => 'value'
//     'lat' => 'value'
//     'lng' => 'value'
//     'image_url' => 'value'
//   ],
];
}